{

  "basics":{
    "name":"Anthony Gonzales",
    "label":"Software Developer",
    "picture":"http://0.gravatar.com/avatar/5fd4080e57721c6e9705b25e1bd48d63",
    "email":"hello@anthonygonzales.dev",
    "phone":"",
    "website":"https://www.anthonygonzales.dev",
    "summary":"I'm a hands-on developer with proven experience building scalable and performant web interfaces for some of the world's most recognized brands. I work methodically, craft innovative solutions, and participate in every part of the product life cycle.",
    "location":{
      "countryCode":"US",
      "address":"NYC"
    },
    "profiles":[
      {
        "network":"LinkedIn",
        "username":"anthonymgonzales",
        "url":"https://www.linkedin.com/in/anthonymgonzales"
      },
      {
        "network":"Github",
        "username":"antgonzales",
        "url":"https://github.com/antgonzales"
      },
      {
        "network":"Stack Overflow",
        "username":"antgonzales",
        "url":"https://stackoverflow.com/users/4500640/antgonzales"
      }
    ]
  },
  "work":[
    {
      "company":"Alkymi",
      "highlights": [
        "Leading web development and contributing to customer facing features and documentation.",
        "Leading API design and contracts.",
        "Promoting best practices for React, Redux Toolkit, and testing with React Testing Library.",
        "Working with product stakeholders to track and estimate projects.",
      ],
      "position":"Senior Software Engineer",
      "startDate":"2023-03-06",
      "endDate":"2023-07-15",
      "summary":"",
      "website":"https://www.alkymi.io"
    },
    {
      "company":"Compass",
      "highlights": [
        "Led a development team of five to redevelop Search for real estate agents. Increased adoption from ~5% to ~60% of agent teams.",
        "Continued to lead API design on backend-for-frontend Graphql service to generate Typescript types.",
        "Promoted best practices for React, React Query, Redux Toolkit, and testing with React Testing Library.",
        "Worked with PM to track projects, timeline, and engineering costs.",
        "Identified and removed user metrics generated by 1.2M bots on Compass.com."
      ],
      "position":"Senior Software Engineer II",
      "startDate":"2020-03-01",
      "endDate":"2023-02-27",
      "summary":"I performed as tech lead on an in-house search project called Agent Search. I currently lead standards and best practices on the front-end team that launched a redesign and development effort of Search for Compass's real estate agents. This project used a previous development effort I led called the MLS Filters project and integrated with several other teams to create efficient customer workflows.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Compass",
      "endDate":"2020-03-01",
      "highlights": [
        "Led a development team of five to implement Search with Multiple Listing Service filters (MLS). Increased adoption in DC market from ~10% to ~50%.",
        "Led API design of a backend-for-frontend Graphql service to generate Typescript types.",
        "Collaborated with contractors to scale the MLS project from DC to all major markets (20).",
        "Promoted Test Driven Development best practices with teams throughout the company, including mentorship, feedback, and learning sessions."
      ],
      "position":"Senior Software Engineer I",
      "startDate":"2019-09-01",
      "summary":"I led front-end development for Compass's MLS Filters project. I worked with a team of developers to architect a dynamic React form system to perform MLS-specific queries. I mentored junior developers and team members on test-driven development best practices and standards. Our team utilized Jest, React Testing Library, and Cypress for testing to maintain code quality and reliability.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Compass",
      "endDate":"2019-09-01",
      "highlights":[
        "Performed as tech lead to develop Compass's CRM application.",
        "Led a team of three front-end engineers to create Compass's first React application built with Typescript.",
        "Worked with PM and engineering manager to scope an MVP product based on customer feedback.",
        "I worked with Quality Assurance engineers to test and implement Cypress for application testing."
      ],
      "position":"Software Engineer II",
      "startDate":"2017-11-30",
      "summary":"Lead front-end development for Compass's CRM application Contacts as a tech lead. I worked with a team of developers to architect a React application with Redux, Redux Sagas, and React Router. I also mentored junior developers and team members on best practices and test-driven development. Our team utilized Jest and Enzyme for unit testing and an in-house end-to-end test framework to maintain code quality and reliability.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Glossier",
      "endDate":"2017-11-30",
      "highlights":[
        "Migrated the website from an Angular monolith to React components.",
        "Introduced testing best practices and code quality standards.",
        "Mentored three remote engineers to learn React and Javascript fundamentals.",
        "Beta tested and implemented Stripe payments in checkout.",
        "Collaborated with PMs and Business Intelligence to follow Segment's <a href='https://segment.com/academy/collecting-data/naming-conventions-for-clean-data/'>Object Action Framework</a> for analytics."
      ],
      "position":"Senior Front-end Engineer",
      "startDate":"2016-02-28",
      "summary":"Developed and led front-end best practices for Glossier.com, an e-commerce beauty website built on Solidus and Ruby on Rails. Added front-end unit testing as part of the development process. I led the migration from Angular monolith to React components.",
      "website":"https://www.glossier.com"
    },
    {
      "company":"Third and Grove",
      "endDate":"2016-02-28",
      "highlights":[
        "Managed a team of front-end engineers across several contract projects.",
        "Participated in project scoping and architecture discussions to secure contracts.",
        "Worked on-site at customer headquarters to mentor and train engineers (Benefit Cosmetics)."
      ],
      "position":"Front-end Engineer",
      "startDate":"2014-07-31",
      "summary":"I managed a team of front-end engineers across several contract projects. I collaborated cross-functionally with project managers and stakeholders to project estimates and deadlines. I conducted front-end audits and created benchmarks to provide customer insights.",
      "website":"https://www.thirdandgrove.com"
    }
  ],
  "volunteer":[

  ],
  "education":[
    {
      "institution":"Westmont College",
      "area":"English",
      "studyType":"Bachelor of Arts",
      "startDate": "2006-08-01",
      "endDate": "2010-05-01",
      "courses":[

      ],
      "url": "https://www.westmont.edu"
    }
  ],
  "awards":[
    {
      "title":"Site of the Year Award 2015: Mint.com",
      "date":"2015-11-30",
      "awarder":"Acquia",
      "summary":"Acquia’s digital agency partners submitted client sites for consideration across various categories. A small committee selected 16 winning projects from 48 finalists, evaluating each site’s visual design, functionality, integration, and overall customer experience to identify the winners in each category. Acquia selected Third and Grove for an award in the Financial Services category for Mint.com, of which I was a front-end architect and engineer."
    }
  ],
  "publications":[

  ],
  "skills":[
    {
      "name":"Programming languages",
      "level":"Master",
      "keywords":[
        "Javascript",
        "Typescript"
      ]
    },
    {
      "name":"Web development",
      "level":"Master",
      "keywords":[
        "HTML",
        "CSS",
        "React",
	      "React Query",
        "Redux Toolkit",
        "Node.js",
        "Git"
      ]
    },
    {
      "name":"Testing",
      "level":"Master",
      "keywords":[
        "Test Driven Development",
        "Jest",
        "Cypress",
        "Nock",
        "Sinon",
	      "Mock Service Worker"
      ]
    }
  ],
  "languages":[
    {
      "language":"en",
      "fluency":"Native Speaker"
    }
  ],
  "interests":[

  ],
  "references":[

  ],
  "projects": [{
    "name": "bettertests.js.org",
    "description": "I created a collection of front-end testing best practices for engineers learning how to test web applications. The website gives examples and explanations to help developers understand the benefits of quality testing practices.",
    "highlights": [
    ],
    "keywords": [
    ],
    "startDate": "2019",
    "endDate": "present",
    "url": "https://bettertests.js.org/",
    "roles": [
      "Creator"
    ],
    "entity": "Better Tests",
    "type": "application"
    }
  ]
}
