{

  "basics":{
    "name":"Anthony Gonzales",
    "label":"Software Developer",
    "picture":"http://0.gravatar.com/avatar/5fd4080e57721c6e9705b25e1bd48d63",
    "email":"hello@anthonygonzales.dev",
    "phone":"",
    "website":"https://www.anthonygonzales.dev",
    "summary":"I'm a hands-on developer with proven experience building scalable and performant web interfaces for some of the world's most recognized brands. I work methodically, craft innovative solutions, and participate in every part of the product life cycle.",
    "location":{
      "countryCode":"US",
      "address":"Brooklyn, NY"
    },
    "profiles":[
      {
        "network":"LinkedIn",
        "username":"anthonymgonzales",
        "url":"https://www.linkedin.com/in/anthonymgonzales"
      },
      {
        "network":"Github",
        "username":"antgonzales",
        "url":"https://github.com/antgonzales"
      },
      {
        "network":"Stack Overflow",
        "username":"antgonzales",
        "url":"https://stackoverflow.com/users/4500640/antgonzales"
      }
    ]
  },
  "work":[
    {
      "company":"Compass",
      "highlights":[
        
      ],
      "position":"Senior Software Engineer II",
      "startDate":"2020-03-01",
      "summary":"I performed as tech lead on an in-house search project called Agent Search. I currently lead standards and best practices on the front-end team that launched a redesign and development effort of Search for Compass's real estate agents. This project used a previous development effort I led called the MLS Filters project and integrated with several other teams to create efficient customer workflows.\n\nMore recently, I've reduced the number of crawlers on our analytics tools by 1.2M per month resulting in better data quality and a reduction in cost across Segment and Datadog.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Compass",
      "endDate":"2020-03-01",
      "highlights":[
        
      ],
      "position":"Senior Software Engineer I",
      "startDate":"2019-09-01",
      "summary":"I led front-end development for Compass's MLS Filters project. I worked with a team of developers to architect a dynamic React form system to perform MLS-specific queries. I mentored junior developers and team members on test-driven development best practices and standards. Our team utilized Jest, React Testing Library, and Cypress for testing to maintain code quality and reliability.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Compass",
      "endDate":"2019-09-01",
      "highlights":[
        
      ],
      "position":"Software Engineer II",
      "startDate":"2017-11-30",
      "summary":"Lead front-end development for Compass's CRM application Contacts as a tech lead. I worked with a team of developers to architect a React application with Redux, Redux Sagas, and React Router. I also mentored junior developers and team members on best practices and test-driven development. Our team utilized Jest and Enzyme for unit testing and an in-house end-to-end test framework to maintain code quality and reliability.",
      "website":"https://www.compass.com"
    },
    {
      "company":"Glossier",
      "endDate":"2017-11-30",
      "highlights":[
        
      ],
      "position":"Senior Front-end Engineer",
      "startDate":"2016-02-28",
      "summary":"Developed and led front-end best practices for Glossier.com, an e-commerce beauty website built on Solidus and Ruby on Rails. Added front-end unit testing as part of the development process. I led the migration from Angular monolith to React components.",
      "website":"https://www.glossier.com"
    },
    {
      "company":"Third and Grove",
      "endDate":"2016-02-28",
      "highlights":[
        
      ],
      "position":"Front-end Architect",
      "startDate":"2015-10-31",
      "summary":"I managed a team of front-end engineers across all projects. I collaborated cross-functionally with project managers and stakeholders to project estimates and deadlines. I conducted front-end audits and created benchmarks to provide customer insights.",
      "website":"https://www.thirdandgrove.com"
    },
    {
      "company":"Third and Grove",
      "endDate":"2015-10-31",
      "highlights":[
        
      ],
      "position":"Front-end Engineer",
      "startDate":"2014-07-31",
      "summary":"I built reproducible best practices for templating, CSS styling, and JS interactions. I led code reviews on Github to ensure developers followed best practices.",
      "website":"https://www.thirdandgrove.com"
    },
    {
      "company":"Blast Analytics & Marketing",
      "endDate":"2014-07-31",
      "highlights":[
        
      ],
      "position":"Digital Marketing Assistant",
      "startDate":"2013-01-31",
      "summary":"",
      "website":"https://www.blastanalytics.com"
    }
  ],
  "volunteer":[
    
  ],
  "education":[
    {
      "institution":"Westmont College",
      "area":"English",
      "studyType":"Bachelor of Arts",
      "startDate": "2006-08-01",
      "endDate": "2010-05-01",
      "courses":[
        
      ],
      "url": "https://www.westmont.edu"
    }
  ],
  "awards":[
    {
      "title":"Site of the Year Award 2015: Mint.com",
      "date":"2015-11-30",
      "awarder":"Acquia",
      "summary":"Acquia’s digital agency partners submitted client sites for consideration across various categories. A small committee selected 16 winning projects from 48 finalists, evaluating each site’s visual design, functionality, integration, and overall customer experience to identify the winners in each category. Acquia selected Third and Grove for an award in the Financial Services category for Mint.com, of which I was a front-end architect and engineer."
    }
  ],
  "publications":[
    
  ],
  "skills":[
    {
      "name":"Programming languages",
      "level":"Master",
      "keywords":[
        "Javascript",
        "Typescript"
      ]
    },
    {
      "name":"Web development",
      "level":"Master",
      "keywords":[
        "HTML",
        "CSS",
        "React",
        "Redux and Redux Toolkit",
        "Node.js",
        "Git"
      ]
    },
    {
      "name":"Testing",
      "level":"Master",
      "keywords":[
        "TDD",
        "Jest",
        "Cypress",
        "Nock",
        "Sinon",
	"MSW",
	"React Query"
      ]
    }
  ],
  "languages":[
    {
      "language":"en",
      "fluency":"Native Speaker"
    }
  ],
  "interests":[
    
  ],
  "references":[
    
  ],
  "projects": [{
    "name": "Benefit Cosmetics",
    "description": "Provided on-site training to help Benefit developers theme Drupal and helped architect the admin workflow for their marketing team. Worked with backend developers to create custom modules for products, several marketing panels, page layouts and a custom cart checkout flow. Worked across contractor projects to ensure a seamless integration into the site.",
    "highlights": [
    ],
    "keywords": [
    ],
    "startDate": "2015",
    "endDate": "2015",
    "url": "https://www.benefitcosmetics.com/",
    "roles": [
      "Tech Lead"
    ],
    "entity": "Entity",
    "type": "application"
  },
  {
    "name": "Fastly",
    "description": "Fastly needed to port over their existing website from Jekyll to Drupal in order to make it easier for their marketing team to write and update content. I oversaw the work of two junior developers and reivewed code through Github’s pull request system.",
    "highlights": [
    ],
    "keywords": [
    ],
    "startDate": "2015",
    "endDate": "2015",
    "url": "https://www.fastly.com/",
    "roles": [
    ],
    "entity": "Entity",
    "type": "application"
  },
  {
    "name": "Dwell",
    "description": " Provided on-site training to help Benefit developers theme Drupal and helped architect the admin workflow for their marketing team. Worked with backend developers to create custom modules for products, several marketing panels, page layouts, and a custom cart checkout flow. Worked across contractor projects to ensure a seamless integration into the site.",
    "highlights": [
    ],
    "keywords": [
    ],
    "startDate": "2014",
    "endDate": "2014",
    "url": "https://www.dwell.com/",
    "roles": [
    ],
    "entity": "Entity",
    "type": "application"
  },
  {
    "name": "Mint",
    "description": "Worked closely with Intuit’s in-house developers to create fresh new marketing websites for marketers. Ensured that front-end load times were minimal due to the high volume of traffic.",
    "highlights": [
      "Site of the Year Award 2015: Mint.com"
    ],
    "keywords": [
    ],
    "startDate": "2014",
    "endDate": "2014",
    "url": "https://www.mint.com/",
    "roles": [
    ],
    "entity": "Entity",
    "type": "application"
  }
  ]
}
